<a href="https://colab.research.google.com/github/Truman7777/M1/blob/main/M1%EA%B3%B5%EB%B6%80_06.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 데이터프레임 연습

In [ ]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [ ]:
# Series
obj = Series(range(4), index= ['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [ ]:
# 인덱스를 기준으로 정렬
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [ ]:
obj # 정렬해도 원본 데이터는 변경되지 않음

d    0
a    1
b    2
c    3
dtype: int64

In [ ]:
frame = DataFrame(np.arange(8).reshape(2, 4),
                  index= ['three', 'one'], columns= ['d', 'a', 'b', 'c'])

frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [ ]:
frame.sort_index() # 인덱스 기준으로 정렬

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [ ]:
frame.sort_index(axis= 1) # 열 기준으로 정렬

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [ ]:
frame.sort_index(axis= 1, ascending= False) # 내림차순 정렬

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [ ]:
frame = DataFrame({'b': [4, 7, 3, 2], 'a': [4, 9, 3, 5], 'c': [5, 3, 7, 9]})
frame

   b  a  c
0  4  4  5
1  7  9  3
2  3  3  7
3  2  5  9

In [ ]:
frame.sort_values(by= 'b') # 컬럼 b를 기준으로 정렬

   b  a  c
3  2  5  9
2  3  3  7
0  4  4  5
1  7  9  3

In [ ]:
frame.sort_values(by= 'a')

   b  a  c
2  3  3  7
0  4  4  5
3  2  5  9
1  7  9  3

In [ ]:
obj = Series([23, 65, 87, 26, 74, 39, 100])
obj.rank() # rank() -> 순위 매기는 함수

0    1.0
1    4.0
2    6.0
3    2.0
4    5.0
5    3.0
6    7.0
dtype: float64

In [ ]:
obj.rank(ascending= False)

0    7.0
1    4.0
2    2.0
3    6.0
4    3.0
5    5.0
6    1.0
dtype: float64

In [ ]:
obj = Series([32, 36, 76, 85, 93, 93, 18])
obj.rank() # 같은 순위가 있을 경우 중간값을 줌

0    2.0
1    3.0
2    4.0
3    5.0
4    6.5
5    6.5
6    1.0
dtype: float64

In [ ]:
obj.rank(method= 'first') # 같은 값 중 먼저 나타나는 것에게 선순위를 줌

0    2.0
1    3.0
2    4.0
3    5.0
4    6.0
5    7.0
6    1.0
dtype: float64

In [ ]:
frame = DataFrame({'b': [4, 7, 3, 2], 'a': [4, 9, 3, 5], 'c': [5, 7, 3, 9]})
frame

   b  a  c
0  4  4  5
1  7  9  7
2  3  3  3
3  2  5  9

In [ ]:
frame.rank(axis= 1) # 같은 행의 각 열에 대해서 순위

     b    a    c
0  1.5  1.5  3.0
1  1.5  3.0  1.5
2  2.0  2.0  2.0
3  1.0  2.0  3.0

In [ ]:
frame = DataFrame({'b': [4, 7, 3, 2], 'a': [4, 9, 2, 5], 'c': [5, 3, 7, np.nan]})
frame

   b  a    c
0  4  4  5.0
1  7  9  3.0
2  3  2  7.0
3  2  5  NaN

In [ ]:
frame.sum() # 같은 열의 각 행에 대해서 합 계산

b    16.0
a    20.0
c    15.0
dtype: float64

In [ ]:
frame.mean() # 같은 열의 각 행에 대해서 평균 계산

b    4.0
a    5.0
c    5.0
dtype: float64

In [ ]:
frame.sum(skipna= False) # skipna= False -> NaN값을 스킵하지 않게 해줌

b    16.0
a    20.0
c     NaN
dtype: float64

In [ ]:
frame.idxmax() # idxmax() -> 최대치가 있는 위치 얻는 함수

b    1
a    1
c    2
dtype: int64

In [ ]:
frame.idxmin() # idxmin() -> 최소치가 있는 위치 얻는 함수

b    3
a    2
c    1
dtype: int64

In [ ]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'b', 'c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    b
8    c
dtype: object

In [ ]:
uniques = obj.unique() # unique() -> 중복되지 않는 항목 찾는 함수
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [ ]:
obj.value_counts() # value_counts() -> 빈도 수 높은 순으로 각 항목 정렬

a    3
b    3
c    2
d    1
dtype: int64

In [ ]:
obj.value_counts(sort= False)

c    2
b    3
a    3
d    1
dtype: int64

In [ ]:
mark = obj.isin(['b', 'c']) # isin() -> 특정한 항목이 들어있는지 확인하는 함수
mark

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [ ]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    b
8    c
dtype: object

In [ ]:
obj[mark]

0    c
5    b
6    b
7    b
8    c
dtype: object

In [ ]:
obj[obj.isin(['b', 'c'])]

0    c
5    b
6    b
7    b
8    c
dtype: object

In [ ]:
frame = DataFrame({'X': ['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'],
                   'Y': ['f', 'g', 'd', 'g', 'h', 'e', 'd', 'h', 'f'],
                   'Z': ['a', 'e', 'd', 'g', 'd', 'e', 'q', 'b', 'c']})
frame

   X  Y  Z
0  c  f  a
1  a  g  e
2  d  d  d
3  a  g  g
4  a  h  d
5  b  e  e
6  b  d  q
7  c  h  b
8  c  f  c

In [ ]:
result = frame.apply(pd.value_counts)
result

     X    Y    Z
a  3.0  NaN  1.0
b  2.0  NaN  1.0
c  3.0  NaN  1.0
d  1.0  2.0  2.0
e  NaN  1.0  2.0
f  NaN  2.0  NaN
g  NaN  2.0  1.0
h  NaN  2.0  NaN
q  NaN  NaN  1.0

In [ ]:
result = frame.apply(pd.value_counts).fillna(0) # fillna(0) -> NaN 대신 0 을 채워넣는다는 표시
result

     X    Y    Z
a  3.0  0.0  1.0
b  2.0  0.0  1.0
c  3.0  0.0  1.0
d  1.0  2.0  2.0
e  0.0  1.0  2.0
f  0.0  2.0  0.0
g  0.0  2.0  1.0
h  0.0  2.0  0.0
q  0.0  0.0  1.0

In [ ]:
NA = np.nan
data = DataFrame([[NA, 6.5, 3.], [NA, NA, NA],
                 [NA, NA, NA], [NA, 6.5, 3.]])
data

    0    1    2
0 NaN  6.5  3.0
1 NaN  NaN  NaN
2 NaN  NaN  NaN
3 NaN  6.5  3.0

In [ ]:
cleaned = data.dropna() # dropna() -> NaN이 하나라도 있으면 해당 행 삭제
cleaned

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [ ]:
data.dropna(how= 'all') # how= 'all' -> 모든 항목이 NA일때만 해당 행 삭제

    0    1    2
0 NaN  6.5  3.0
3 NaN  6.5  3.0

In [ ]:
clean2 = data.dropna(axis= 1)
clean2

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [ ]:
clean3 = data.dropna(how= 'all', axis= 1)
clean3

     1    2
0  6.5  3.0
1  NaN  NaN
2  NaN  NaN
3  6.5  3.0

In [ ]:
df = DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df.iloc[0, 0] = NA
df

          0         1         2
0       NaN       NaN       NaN
1  0.030321       NaN       NaN
2 -0.070405       NaN -1.369706
3  1.698578       NaN -0.917077
4 -0.606842 -0.821455 -0.457163
5  1.166555 -1.083892 -0.183929
6 -1.843194 -0.013137 -3.663388

In [ ]:
df.dropna(thresh= 2) # thresh -> NaN이 아닌 데이터가 몇개 이상이면 삭제하지 않을지 정하는 변수

          0         1         2
2 -0.070405       NaN -1.369706
3  1.698578       NaN -0.917077
4 -0.606842 -0.821455 -0.457163
5  1.166555 -1.083892 -0.183929
6 -1.843194 -0.013137 -3.663388

In [ ]:
df.dropna(thresh= 5, axis = 1)

          0         2
0       NaN       NaN
1  0.030321       NaN
2 -0.070405 -1.369706
3  1.698578 -0.917077
4 -0.606842 -0.457163
5  1.166555 -0.183929
6 -1.843194 -3.663388

In [ ]:
df.fillna({1: 0.5, 2: -1})

          0         1         2
0       NaN  0.500000 -1.000000
1  0.030321  0.500000 -1.000000
2 -0.070405  0.500000 -1.369706
3  1.698578  0.500000 -0.917077
4 -0.606842 -0.821455 -0.457163
5  1.166555 -1.083892 -0.183929
6 -1.843194 -0.013137 -3.663388

In [ ]:
df2 = df.fillna({1: 0.5, 3:-1})
df2

          0         1         2
0       NaN  0.500000       NaN
1  0.030321  0.500000       NaN
2 -0.070405  0.500000 -1.369706
3  1.698578  0.500000 -0.917077
4 -0.606842 -0.821455 -0.457163
5  1.166555 -1.083892 -0.183929
6 -1.843194 -0.013137 -3.663388

In [ ]:
df # 데이터프레임을 조작해도 원래의 값은 변경되지 않는다.

          0         1         2
0       NaN       NaN       NaN
1  0.030321       NaN       NaN
2 -0.070405       NaN -1.369706
3  1.698578       NaN -0.917077
4 -0.606842 -0.821455 -0.457163
5  1.166555 -1.083892 -0.183929
6 -1.843194 -0.013137 -3.663388